In [1]:
import pandas as pd

In [73]:
df=pd.read_csv('D:\Data_set\GDPList.csv',encoding='ISO-8859-1')

In [57]:
df.head()

        Country      Continent  GDP (millions of US$)
0   Afghanistan           Asia                  18181
1       Albania         Europe                  12847
2       Algeria         Africa                 190709
3        Angola         Africa                 100948
4     Argentina  South America                 447644

In [58]:
df.shape

(125, 3)

In [59]:
df.describe()

       GDP (millions of US$)
count           1.250000e+02
mean            5.554278e+05
std             1.649266e+06
min             1.060000e+04
25%             2.574200e+04
50%             9.608900e+04
75%             3.332380e+05
max             1.509402e+07

In [76]:
df.rename(columns={'Country':'Nuoc','Continent':'Chau luc','GDP (millions of US$)':'GDP (trieu $)'},inplace=True)

In [77]:
df.head()

           Nuoc       Chau luc  GDP (trieu $)
0   Afghanistan           Asia          18181
1       Albania         Europe          12847
2       Algeria         Africa         190709
3        Angola         Africa         100948
4     Argentina  South America         447644

In [78]:
df['Thanh Pho']=df['Nuoc']

In [79]:
df.head()

           Nuoc       Chau luc  GDP (trieu $)     Thanh Pho
0   Afghanistan           Asia          18181   Afghanistan
1       Albania         Europe          12847       Albania
2       Algeria         Africa         190709       Algeria
3        Angola         Africa         100948        Angola
4     Argentina  South America         447644     Argentina

In [80]:
df.replace('Vietnam','Hanoi',inplace=True)

In [81]:
df.tail()

            Nuoc       Chau luc  GDP (trieu $)    Thanh Pho
120   Uzbekistan           Asia          45353   Uzbekistan
121    Venezuela  South America         315841    Venezuela
122      Vietnam           Asia         122722      Vietnam
123        Yemen         Africa          33675        Yemen
124       Zambia         Africa          19206       Zambia

In [84]:
df.drop(df.loc[df['Chau luc']=='Asia'].index,axis=0,inplace=True)

In [85]:
df.drop(df.loc[df['GDP (trieu $)']<30000].index,axis=0,inplace=True)